{"title":"LANDWAR: Official App","subtitle":"Gameplay utility and player-aide.","url":"https://subject9x.itch.io/landwar-official-app","thumb":"/img/projectsCode/strikerAlphaThumb.png","date":"09-2023","details":[{"type":"Team","data":[{"name":"Peter Roohr","roles":[]}]},{"type":"Tech","data":[{"name":"ElectronJS ","url":"https://www.electronjs.org/"},{"name":"Furtive-CSS","url":"https://www.furtive.co/"}]},{"type":"Links","data":[{"name":"itch.io","url":"https://subject9x.itch.io/landwar-official-app"}]},{"type":"Tools","data":[{"name":"Visual Studio: Code","url":"https://code.visualstudio.com/"}]}],"features":["Built in Electron for cross-platform desktop environments.","Complete Unit Editor and Army List builder.","User can load / edit / save custom .csv files.","Users can export their unit data to pdf.","Rules provided for and can be saved to pdf.","Interactive wiki system for Special Rules, and Unit customization system."],"desc":["The app started life as a convenience tool for me to develop LANDWAR the tabletop game. I needed a way to quickly test balancing mechanics, and custom units to test point costs and rules. I was also casting around for a good framework post-2018 to build desktop apps from, and Electron fit the bill. I essentially taught myself to cobble together an Electron app. I was already familiar with the Javascript/HTML/CSS world having built websites in the past, so the only real new stuff was the Electron environment itself and the build/deploy pipelines.","The app is small but feature-rich, users can immediately download a copy of all relevant rules as clean PDF files (generated from formatted HTML). Additionally they can generate a custom number of blank unit cards and print them out as well. ","Next is the Unit Editor which is the main function of the app. Here users can load / edit / save .csv files containing unit stats. The point-costs are calculated in real time, allowing the player endlessly tweak their stats to their taste. Then they can open the ‘tags’ menu to assign custom rules and abilities to their units. Again, costs are calculated in real-time, and requirements are updated in response to user input.","Finally, users can then load/edit/save army list csv files (they technically the same as unit editor files but can contain duplicate entries). The army lists are used for playing games of LANDWAR. Once players have assembled their lists, they can automatically generated the list into a printable pdf and a companion pdf of all the special rules that list has!","Overall, a powerful, low-cost package to make playing LANDWAR incredibly accessible."],"media":["/img/code/lwapp/landwarapp_1.png","/img/code/lwapp/landwarapp_2.png","/img/code/lwapp/landwarapp_3.png","/img/code/lwapp/landwarapp_4.png"]}