{"title":"Zond I","subtitle":"2D arcade space shooter made entirely in Java with the Lightweight-Java-Game-Library.","url":"https://subject9x.itch.io/landwar-official-app","thumb":"/img/projectsCode/strikerAlphaThumb.png","date":"01-23-2013","details":[{"type":"Team","data":[{"name":"Peter Roohr","roles":[]},{"name":"Eamonn McHugh-Roohr","url":"http://eamonnmr.com/","roles":[]}]},{"type":"Tech","data":[{"name":"LWJGL","url":"https://www.lwjgl.org/"},{"name":"Slick2D","url":"http://slick.ninjacave.com/"},{"name":"XPP"}]},{"type":"Links","data":[{"name":"Game Source code","url":"https://github.com/EamonnMR/Zond"}]},{"type":"Tools","data":[{"name":"GIMP","url":"https://www.gimp.org/"}]}],"features":["Customizable HUD.","Customizable ships.","Space physics.","Easy mod system using JSON-like data language.","Easy-to-learn Level Data Structure for customizing levels."],"desc":["Zond is a top-down, 2D space combat game developed in Java for computer. This was the first game project that I completed from start to finish. Work began in late Spring of 2012 with my cousin, Eammon. Our stated goal was to create a game from scratch to get experience developing games. We chose a top-down 2d format because it was an attainable setup. Both of us also have a love of the Space Race Era and relevant spacecraft designs.","Zond plays almost like a modified version of Asteroids. The player takes control of a ship either from NASA or the USSR. The game provides a few scenarios each with different objectives. Before each mission, the player may customize various parts of their ship; engines, weapons, and the ship itself. Each item has varied stats that affect ship performance.","A cool feature; Eammon devised his own JSON-like language that we used to create the data files for the game. These data files are colloquially called ‘rust’ files because of the .rst extension. The language itself operates almost exactly like JSON and can be edited with any text editor.","Zond was developed to a ‘beta’ state by December 2012 and a playable build was released for Christmas 2012. A follow up patch adding in slightly better AI, bullet spread, and a few fixes was finished for January 2013. The release you can find here is the 2013 version."],"media":["/img/code/zond/zond_1.png","/img/code/zond/zond_2.png","/img/code/zond/zond_3.png","/img/code/zond/zond_4.png"]}